# Вычислить число c заданной точностью d
# Пример:
# - при d = 0.001, π = 3.141
# Ввод: 0.01
# Вывод: 3.14
# Ввод: 0.001
# Вывод: 3.141

def count(x: float) -> int:
    count = 0
    while x < 1:
        x *= 10
        count += 1
    return count

pi = '3,141592653589793238462643383279'
d = float(input('Введите точность d --> '))
print(pi[0:count(d)+2])
